STAR03-byte/STM32-Lab/Projects/RTOS_LED_GUI/Core/board.h
#ifndef __BOARD_H___
#define __BOARD_H___

#ifdef __cplusplus
extern "C"{
#endif

#include <stdio.h>
#include <stdarg.h>

#include "stm32f4xx_adc.h"
#include "stm32f4xx_dma.h"
#include "stm32f4xx_exti.h"
#include "stm32f4xx_flash.h"
#include "stm32f4xx_fsmc.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_pwr.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_rtc.h"
#include "stm32f4xx_sdio.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_usart.h"

#include "misc.h" /* High level functions for NVIC and SysTick (add-on to CMSIS functions) */

#include "system_stm32f4xx.h"

/* BSP头文件 */
#include "bsp_led.h"
#include "bsp_key.h"
#include "bsp_debug_usart.h"
#include "bsp_lcd.h"

/* emXGUI配置 */
#include "gui_drv_cfg.h"
#include "gui_os_port.h"
#include "gui_font_port.h"
#include "gui_drv.h"
#include "def.h"

/*=========================================================================================*/

#define KB    (1024)
#define MB    (1024*KB)

/*=========================================================================================*/

/* FSMC地址定义 */
#define CCM_BASE            0x10000000
#define CCM_SIZE            (64*KB)

#define ONCHIP_SRAM1_BASE   0x20000000
#define ONCHIP_SRAM1_SIZE   (112*KB)

#define ONCHIP_SRAM2_BASE   0x2001C000
#define ONCHIP_SRAM2_SIZE   (16*KB)

#define FSMC_BANK1_BASE     0x60000000
#define FSMC_BANK2_BASE     0x64000000
#define FSMC_BANK3_BASE     0x68000000
#define FSMC_BANK4_BASE     0x6C000000

#define EXT_SRAM_BASE       FSMC_BANK4_BASE
#define EXT_SRAM_SIZE       (1024*KB)

#define EXT_LCD_BASE        FSMC_BANK3_BASE

#define EXT_SRAM_FSMC_BANK  FSMC_Bank1_NORSRAM4
#define EXT_LCD_FSMC_BANK   FSMC_Bank1_NORSRAM3

/*=========================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /*__BOARD_H___*/
